tests/vcr/tests.ouimeaux_device.test_lightswitch/Test_WLS040.test_turn_off.yaml

interactions:
- request:
    body: '<?xml version="1.0" encoding="utf-8"?>

      <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">

      <s:Body>

      <u:SetBinaryState xmlns:u="urn:Belkin:service:basicevent:1">

      <BinaryState>0</BinaryState>

      </u:SetBinaryState>

      </s:Body>

      </s:Envelope>'
    headers:
      Content-Type:
      - text/xml
      SOAPACTION:
      - '"urn:Belkin:service:basicevent:1#SetBinaryState"'
    method: POST
    uri: http://192.168.1.100:49153/upnp/control/basicevent1
  response:
    body:
      string: "<s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"><s:Body>\n<u:SetBinaryStateResponse
        xmlns:u=\"urn:Belkin:service:basicevent:1\">\r\n<BinaryState>0</BinaryState>\r\n<CountdownEndTime>0</CountdownEndTime>\r\n<deviceCurrentTime>1639934872</deviceCurrentTime>\r\n</u:SetBinaryStateResponse>\r\n</s:Body>
        </s:Envelope>"
    headers:
      CONTENT-LENGTH:
      - '376'
      CONTENT-TYPE:
      - text/xml; charset="utf-8"
      DATE:
      - Sun, 19 Dec 2021 17:27:52 GMT
      EXT:
      - ''
      SERVER:
      - Unspecified, UPnP/1.0, Unspecified
      X-User-Agent:
      - redsonic
    status:
      code: 200
      message: OK
- request:
    body: '<?xml version="1.0" encoding="utf-8"?>

      <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">

      <s:Body>

      <u:GetBinaryState xmlns:u="urn:Belkin:service:basicevent:1">


      </u:GetBinaryState>

      </s:Body>

      </s:Envelope>'
    headers:
      Content-Type:
      - text/xml
      SOAPACTION:
      - '"urn:Belkin:service:basicevent:1#GetBinaryState"'
    method: POST
    uri: http://192.168.1.100:49153/upnp/control/basicevent1
  response:
    body:
      string: "<s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"><s:Body>\n<u:GetBinaryStateResponse
        xmlns:u=\"urn:Belkin:service:basicevent:1\">\r\n<BinaryState>0</BinaryState>\r\n</u:GetBinaryStateResponse>\r\n</s:Body>
        </s:Envelope>"
    headers:
      CONTENT-LENGTH:
      - '285'
      CONTENT-TYPE:
      - text/xml; charset="utf-8"
      DATE:
      - Sun, 19 Dec 2021 17:27:52 GMT
      EXT:
      - ''
      SERVER:
      - Unspecified, UPnP/1.0, Unspecified
      X-User-Agent:
      - redsonic
    status:
      code: 200
      message: OK
version: 1
